{
  "oops": [
    {
      "topicId": 1,
      "heading": "What is React ?",
      "body": [
        "React is a JavaScript library.",
        "It is component-based front-end library responsible for the view layer of application.",
        "It is used to create single page applications.",
        "It makes use of component based structure by which we can reuse any component any number of times.",
        "It is developed and maintained by Facebook now Meta.",
        "we can install it by running the command."
      ],
      "example": "npm install react"
    },
    {
      "topicId": 2,
      "heading": "What is ReactDOM ?",
      "body": [
        "ReactDOM is a package in React that provides methods for interacting with the Document Object Model (DOM).",
        "ReactDOM is primarily used to render React elements into the DOM.",
        "ReactDOM.render(): This method is used to render a React element into the DOM"
      ],
      "example": [
        "import React from 'react';\n",
        "import ReactDOM from 'react-dom';\n",
        "",
        "const element = <h1>Hello, React!</h1>;\n",
        "ReactDOM.render(element, document.getElementById('root'));"
      ]
    },
    {
      "topicId": 3,
      "heading": "What is react-router-dom ?",
      "body": [
        "'react-router-dom' is a package for React that provides routing capabilities for single-page applications.",
        "It navigates to the component without reloding the entire page.",
        "It saves the server load and faster reloding"
      ],
      "example": ""
    },
    {
      "topicId": 3,
      "heading": "What is JSX ?",
      "body": [
        "JSX is Generally know as JavaScript XML.",
        "It is used to include HTML like content in javascript files.",
        "JSX makes use of React.createElement which creates an object which is rendered in HTML(DOM)",
        "JSX can have only one parent.",
        "To include multiple parent it uses React.Fragment ' <></> '."
      ],
      "example": [
        "const element = <h1>Hello, JSX!</h1>;\n",
        " // gets transformed into\n",
        "const element = React.createElement('h1', null, 'Hello, JSX!');"
      ]
    },
    {
      "topicId": 4,
      "heading": "Why react is fast ?",
      "body": [
        "React is fast because it uses something known as Virtual DOM.",
        "Virtual DOM stores a tree like structure which is representation of actual DOM.",
        "Which then uses Reconciliation method.",
        "Which implements the diffing algorithms and gives which nodes have been modified.",
        "Then react re-reders only those nodes instead of complete DOM tree.",
        "In order to uniquely identify each node and check for update react requires unique key for each node."
      ],
      "sampleImageUrl": "https://imgs.search.brave.com/A0CW91E0odxmM1A9BAR5RuZf1Wz1Nes9jCQ7ymGu2EY/rs:fit:860:0:0/g:ce/aHR0cHM6Ly93d3cu/a25vd2xlZGdlaHV0/LmNvbS9fbmV4dC9p/bWFnZT91cmw9aHR0/cHM6Ly9kMm8ydXRl/YnNpeHU0ay5jbG91/ZGZyb250Lm5ldC9t/ZWRpYS9pbWFnZXMv/MTY1MDI2Nzc4MDg4/MC1JbWFnZS0yJTIw/KDQpLnBuZyZ3PTM4/NDAmcT03NQ",
      "example": null
    },
    {
      "topicId": 5,
      "heading": "What are React Hooks ?",
      "body": [
        "Hooks are react functions which helps in state mangement without writing a class.",
        "Hooks allow you to reuse stateful logic without changing your component hierarchy.",
        "Stateful logic can be extracted from components and tested independently with use of hooks.",
        "Hooks let you split one component into smaller functions based on what pieces are related.",
        "Classes don’t minify very well, and they make hot reloading flaky and unreliable.",
        "To solve these problems, Hooks let you use more of React’s features without classes.",
        "Crucially, Hooks work side-by-side with existing code so you can adopt them gradually.",
        "Crucially, Hooks work side-by-side with existing code so you can adopt them gradually."
      ],
      "sampleImageUrl": null,
      "example": null
    }
  ]
}
